Repository: jkolo/yubikey-oath-krunner
Catalog: src/shared/po/*.po
Languages: pl

source: Add OATH Credential to YubiKey
pl: Dodaj dane OATH do YubiKey

source: Scan QR Code from Screen
pl: Skanuj kod QR z ekranu

source: Capture screenshot and scan QR code
pl: Przechwyć zrzut ekranu i zeskanuj kod QR

source: e.g., Google, GitHub
pl: np. Google, GitHub

source: Issuer:
pl: Wystawca:

source: e.g., user@example.com
pl: np. użytkownik@przykład.pl

source: Account:
pl: Konto:

source: Base32 encoded secret
pl: Sekret zakodowany w Base32

source: Show/hide secret
pl: Pokaż/ukryj sekret

source: Secret:
pl: Sekret:

source: TOTP (Time-based)
pl: TOTP (Oparty na czasie)

source: HOTP (Counter-based)
pl: HOTP (Oparty na liczniku)

source: Type:
pl: Typ:

source: Algorithm:
pl: Algorytm:

source: Digits:
pl: Cyfry:

source: seconds
pl: sekund

source: Period:
pl: Okres:

source: Initial Counter:
pl: Licznik początkowy:

source: Require physical touch to generate code
pl: Wymagaj fizycznego dotknięcia do generowania kodu

source: No devices available
pl: Brak dostępnych urządzeń

source: Target Device:
pl: Urządzenie docelowe:

source: Add to YubiKey
pl: Dodaj do YubiKey

source: Require Touch feature requires firmware version 4.2.4 or later. Current version on %1: %2
pl: Funkcja 'Wymagaj dotyku' wymaga firmware w wersji 4.2.4 lub nowszej. Aktualna wersja na %1: %2

source: Saving credential to YubiKey...
pl: Zapisywanie danych do YubiKey...

source: Issuer is required
pl: Wystawca jest wymagany

source: Account is required
pl: Konto jest wymagane

source: Secret is required
pl: Sekret jest wymagany

source: Scanning screen
pl: Skanowanie ekranu

source: Processing QR code
pl: Przetwarzanie kodu QR

source: No QR code found in the screenshot. Please try again.
pl: Nie znaleziono kodu QR w zrzucie ekranu. Spróbuj ponownie.

source: QR code scanned successfully. Please review the information below.
pl: Kod QR zeskanowany pomyślnie. Sprawdź poniższe informacje.

source: Screenshot capture failed. Please ensure: • KDE/KWin compositor is running • No other screenshot tools are active • Daemon has proper D-Bus permissions
pl: Nie udało się przechwycić zrzutu ekranu. Upewnij się, że: • Kompozytor KDE/KWin jest uruchomiony • Żadne inne narzędzia do zrzutów ekranu nie są aktywne • Demon ma odpowiednie uprawnienia D-Bus

source: Failed to generate code
pl: Nie udało się wygenerować kodu

source: Cancelled
pl: Anulowano

source: Touch operation cancelled for '%1'
pl: Operacja dotknięcia anulowana dla '%1'

source: Error
pl: Błąd

source: Failed to execute action after reconnect
pl: Nie udało się wykonać akcji po ponownym podłączeniu

source: Timeout
pl: Limit czasu

source: YubiKey '%1' was not reconnected in time
pl: YubiKey '%1' nie został podłączony na czas

source: Reconnect to '%1' cancelled
pl: Anulowano ponowne łączenie z '%1'

source: %1 (copied) • expires in %2s
pl: %1 (w schowku) • do wygaśnięcia %2s

source: Timeout in %1s
pl: Limit czasu: %1s

source: Cancel
pl: Anuluj

source: Please touch your YubiKey
pl: Dotknij YubiKey

source: Pressed keys: %1
pl: Wciśnięte klawisze: %1

source: Please release modifier keys
pl: Zwolnij klawisze modyfikujące

source: Code Input Cancelled
pl: Wpisywanie kodu anulowane

source: Modifier keys were held down for too long
pl: Klawisze modyfikujące były trzymane zbyt długo

source: Connect YubiKey '%1'
pl: Podłącz YubiKey '%1'

source: Operation cancelled
pl: Operacja anulowana

source: Touch Timeout
pl: Przekroczono limit czasu dotknięcia

source: No code available to type
pl: Brak kodu do wpisania

source: Text input not available
pl: Wprowadzanie tekstu niedostępne

source: Permission Denied
pl: Odmowa dostępu

source: Code: %1 (copied to clipboard)
pl: Kod: %1 (skopiowano do schowka)

source: Failed to type code, copied to clipboard instead
pl: Nie udało się wpisać kodu, skopiowano do schowka

source: No code available to copy
pl: Brak kodu do skopiowania

source: Clipboard not available
pl: Schowek niedostępny

source: Failed to copy to clipboard
pl: Nie udało się skopiować do schowka

source: No YubiKey devices connected
pl: Nie podłączono urządzeń YubiKey

source: Showing credential dialog
pl: Wyświetlanie okna dialogowego danych uwierzytelniających

source: Device not found
pl: Nie znaleziono urządzenia

source: Invalid credential type (must be TOTP or HOTP)
pl: Nieprawidłowy typ danych uwierzytelniających (musi być TOTP lub HOTP)

source: Credential added successfully
pl: Dane uwierzytelniające dodane pomyślnie

source: No device selected
pl: Nie wybrano urządzenia

source: Credential with this name already exists on the YubiKey
pl: Dane o tej nazwie już istnieją na YubiKey

source: Invalid URI format
pl: Nieprawidłowy format URI

source: URI must start with otpauth://
pl: URI musi zaczynać się od otpauth://

source: Type must be 'totp' or 'hotp'
pl: Typ musi być 'totp' lub 'hotp'

source: Label (account name) is required
pl: Etykieta (nazwa konta) jest wymagana

source: Secret parameter is required
pl: Parametr sekretu jest wymagany

source: Invalid algorithm (must be SHA1, SHA256, or SHA512)
pl: Nieprawidłowy algorytm (musi być SHA1, SHA256 lub SHA512)

source: Invalid digits (must be 6, 7, or 8)
pl: Nieprawidłowa liczba cyfr (musi być 6, 7 lub 8)

source: Invalid period (must be positive integer)
pl: Nieprawidłowy okres (musi być dodatnią liczbą całkowitą)

source: Counter parameter is required for HOTP
pl: Parametr licznika jest wymagany dla HOTP

source: Invalid counter value
pl: Nieprawidłowa wartość licznika

source: Image file not found: %1
pl: Nie znaleziono pliku obrazu: %1

source: Failed to load image: %1
pl: Nie udało się wczytać obrazu: %1

source: Image is null or invalid
pl: Obraz jest pusty lub nieprawidłowy

source: No QR code found in image or failed to decode
pl: Nie znaleziono kodu QR w obrazie lub niepowodzenie dekodowania

source: Invalid password. Please try again.
pl: Nieprawidłowe hasło. Spróbuj ponownie.

source: Failed to change password. The current password may be incorrect, or the YubiKey may not be accessible.
pl: Nie udało się zmienić hasła. Obecne hasło może być niepoprawne lub YubiKey może być niedostępny.

source: Authorize YubiKey
pl: Autoryzuj YubiKey

source: Enter YubiKey OATH password for device:
pl: Wprowadź hasło dla YubiKey OATH dla urządzenia:

source: Edit device name
pl: Edytuj nazwę urządzenia

source: Enter device name
pl: Wprowadź nazwę urządzenia

source: Password:
pl: Hasło:

source: YubiKey OATH password
pl: Hasło YubiKey OATH

source: Verifying password...
pl: Weryfikacja hasła...

source: Change YubiKey Password
pl: Zmień hasło YubiKey

source: Change password for YubiKey device:
pl: Zmiana hasła dla urządzenia YubiKey:

source: Current YubiKey password
pl: Obecne hasło YubiKey

source: Current password:
pl: Obecne hasło:

source: No password currently set
pl: Brak ustawionego hasła

source: New password
pl: Nowe hasło

source: New password:
pl: Nowe hasło:

source: Confirm new password
pl: Potwierdź nowe hasło

source: Confirm password:
pl: Potwierdź hasło:

source: Remove password protection
pl: Usuń ochronę hasłem

source: Check this to remove password protection from the YubiKey. When checked, the new password fields will be disabled.
pl: Zaznacz, aby usunąć ochronę hasłem z YubiKey. Po zaznaczeniu pola nowego hasła zostaną wyłączone.

source: Change Password
pl: Zmień hasło

source: (password will be removed)
pl: (hasło zostanie usunięte)

source: Remove Password
pl: Usuń hasło

source: Current password is required
pl: Obecne hasło jest wymagane

source: New password cannot be empty
pl: Nowe hasło nie może być puste

source: Passwords do not match
pl: Hasła nie są zgodne

source: New password must be different from current password
pl: Nowe hasło musi różnić się od obecnego hasła

source: Credential name is required
pl: Nazwa danych jest wymagana

source: Secret must be valid Base32 (A-Z, 2-7)
pl: Sekret musi być w formacie Base32 (A-Z, 2-7)

source: Digits must be 6, 7, or 8
pl: Liczba cyfr musi wynosić 6, 7 lub 8

source: Period must be positive
pl: Okres musi być dodatni

source: Password change failed. The current password may be incorrect, or the YubiKey may not be accessible.
pl: Zmiana hasła nie powiodła się. Obecne hasło może być niepoprawne lub YubiKey może być niedostępny.

source: Disconnected
pl: Rozłączone

source: Password required
pl: Wymagane hasło

source: Authorized
pl: Autoryzowane

source: Connected
pl: Podłączone

source: Last seen: %1
pl: Ostatnio widziane: %1

source: Authorize
pl: Autoryzuj

source: just now
pl: przed chwilą

source: 1 minute ago
pl: minutę temu

source: 1 hour ago
pl: godzinę temu

source: yesterday
pl: wczoraj

source: 1 day ago
pl: dzień temu

source: 1 week ago
pl: tydzień temu

source: 1 month ago
pl: miesiąc temu

source: Password cannot be empty
pl: Hasło nie może być puste

source: Type code
pl: Wpisz kod

source: Copy to clipboard
pl: Kopiuj do schowka

source: Delete credential
pl: Usuń dane

source: Capture QR code and add credential
pl: Przechwyć kod QR i dodaj dane uwierzytelniające

source: Delete Credential?
pl: Usunąć dane?

source: Are you sure you want to delete '%1' from your YubiKey? This action cannot be undone.
pl: Czy na pewno chcesz usunąć '%1' z YubiKey? Tej operacji nie można cofnąć.

# search keyword
source: add
pl: dodaj

source: Unknown action
pl: Nieznana akcja

source: YubiKey password required: %1
pl: Wymagane hasło YubiKey: %1

source: Device: %1 - Click to enter password
pl: Urządzenie: %1 - Kliknij, aby wprowadzić hasło
